** Clujure
#+BEGIN_SRC js :cmd "babel-node"
  var digit_name = (function (n) {
      var names;
      return function (n) {
          if (!names){
              names = ['zero', 'one', 'two', 'three','four', 'five','six' ];
          }
          return names[n];
      };
  }());
  console.log(digit_name(6));
#+END_SRC

#+RESULTS:
: six
: undefined

** split words
#+NAME: splitw
#+BEGIN_SRC js :cmd "babel-node" :var a="Test123***  TEST"
    return a.split(" ").reduce(function (max, val) {
        console.log(max + "  " + val);
        return val.length > max ? val.length : max;
    } , 0);
#+END_SRC

#+RESULTS: splitw
: 0  Test123***
: 10
: 10  TEST
: 10

** multidimen arrary
#+BEGIN_SRC js :cmd "babel-node" :results output
  function largestOfFour(arr) {
    var p=[];
    arr.reduce(function(arrmax, arr1){
        var maxnumberofthearray = arr1.reduce(function(elmmax, elm) {
            return elm > elmmax ? elm: elmmax;
        },0);
        p.push(maxnumberofthearray);
        return 0;
    } , 0);
    return p;
  }

  console.log(largestOfFour([[4, 5, 1, 3], [13, 27, 18, 26], [32, 35, 37, 39], [1000, 1001, 857, 1]]));
#+END_SRC

#+RESULTS:
: [ 5, 27, 39, 1001 ]

*** MAP
#+BEGIN_SRC js :cmd "babel-node" :results output
  var contacts = [
      {
          "firstName": "Akira",
          "lastName": "Laine",
          "number": "0543236543",
          "likes": ["Pizza", "Coding", "Brownie Points"]
      },
      {
          "firstName": "Harry",
          "lastName": "Potter",
          "number": "0994372684",
          "likes": ["Hogwarts", "Magic", "Hagrid"]
      },
      {
          "firstName": "Sherlock",
          "lastName": "Holmes",
          "number": "0487345643",
          "likes": ["Intriguing Cases", "Violin"]
      },
      {
          "firstName": "Kristian",
          "lastName": "Vos",
          "number": "unknown",
          "likes": ["Javascript", "Gaming", "Foxes"]
      }
  ];


  function lookUp(firstName, prop){
  // Only change code below this line
    var directory = contacts.filter(function(address){
      if ( (prop in  address) && address["firstName"] === firstName ){
        return true;
      }
      return false;
    });
    return !directory.length ? "No such contact" : directory[0][prop];

  // Only change code above this line
  }

  // Change these values to test your function
  console.log(lookUp("Akira", "likes"));

#+END_SRC

#+RESULTS:
: [ 'Pizza', 'Coding', 'Brownie Points' ]

** char to string
#+BEGIN_SRC js :cmd "babel-node" :results output
  var a = "URYYB".split("").map(function(p){
      return /\s/.test(p) ? p: String.fromCharCode((p.charCodeAt(0)-65 +13)%26 +65);
  });
  console.log( "" + a);
#+END_SRC

#+RESULTS:
: H,E,L,L,O

** string Matching case
#+BEGIN_SRC js :cmd "babel-node" :results output
  function mutation(arr) {
    return arr[1].toLowerCase().split("").filter(function(m){
      return arr[0].toLowerCase().split("").indexOf(m) >= 0;
    }).length === arr[1].length;
/*
.reduce(function(a,b){
      if (a){
        return b >= 0? true: false;
      }
      return false;
    });
*/
  }
  console.log("|" + mutation(["hello", "Hello"]) + "|");
#+END_SRC

#+RESULTS:
: |true|

** Function Argument convert to array
#+BEGIN_SRC js :cmd "babel-node" :resutls output
  function destroyer(arr) {
    // Remove all the values
      var args = Array.prototype.slice.call(arguments, 1);
    return arr.filter(function(v){
        return !args.reduce(function(isthere,val){
            if (isthere === true) return true;
            return  (val === v) ? true : false;
      },false);
    });
  }

console.log(destroyer([1, 2, 3, 1, 2, 3], 2, 3));
#+END_SRC

#+RESULTS:
| 1 | 1 |

** sort
#+BEGIN_SRC js :cmd "babel-node" :resutls output
  function where(arr, num) {
    // Find my place in this sorted array.
    return arr.sort(function(a,b){
      return a > b;
    }).reduce(function(a,pos,index) {
        if ( pos < num )
            return a+1;
        return a;
    },0);
  }
  console.log(where([40, 60], 50));
#+END_SRC

#+RESULTS:
: 1
: undefined
** Sum min to max

#+BEGIN_SRC js :cmd "babel-node" :resutls output
  function sumAll(arr) {
    return [Math.min(arr[0],arr[1]), Math.max(arr[0],arr[1])].reduce(function(sum,b){
        return (b*(b+1))/2 - sum;
    },Math.min(arr[0],arr[1]));
  }

  console.log(sumAll([1, 4]));
#+END_SRC

#+RESULTS:
: 10
: undefined

** diffs

#+BEGIN_SRC js :cmd "babel-node" :resutls  output
  function diff(arr1, arr2) {
      var arr = arr1;
      // Same, same; but different.

      return arr2.filter( function (val) {
          var flag=true;
          arr = arr.reduce(function(diffs,elm){
              if(elm === val){
                  flag = false;
                  return diffs;
              }
              return diffs.concat(elm);
          },[]);
          return flag;
      }).concat(arr);
  }

return  diff(["andesite", "grass", "dirt", "pink wool", "dead shrub"], ["diorite", "andesite", "grass", "dirt", "dead shrub"]);

#+END_SRC

#+RESULTS:
| diorite | pink wool |

** Roman Numerial
#+NAME: ruman
#+BEGIN_SRC js :cmd "babel-node" :var num="353"
  var rumannumberrule = function(x,index){
      var rumancombination = [["I","V"],["X","L"],["C","D"]];
      if (x < 4) return rumancombination[index][0].repeat(x);
      if (x === 4) return rumancombination[index].join("");
      if (x < 9 ) return rumancombination[index][1] +  rumancombination[index][0].repeat(x-5);
      return rumancombination[index][0] + rumancombination[index+1][0];
  };

  var numtoarray = function(nm, numarr){
      if (nm === 0) return numarr;
      numarr.unshift(nm%10);
      return numtoarray(Math.floor(nm/10),numarr);
  };

  return numtoarray(num,[]).map(function(val, index,arrl) {
      return rumannumberrule(val,arrl.length - index -1);
  }).join("");
#+END_SRC

#+RESULTS: ruman
: CCCLIII

#+call: ruman(19)

#+RESULTS:
: XIX


#+BEGIN_SRC js :cmd "babel-node" :var r="I"
  var numtoarray = function(nm, numarr){
      if (nm === 0) return numarr;
      numarr.push(nm%10);
      return numtoarray(Math.floor(nm/10),numarr);
  };
  return numtoarray(322, []);
#+END_SRC

#+RESULTS:
| 2 | 2 | 3 |

** Reduce Data to Manipulate
#+BEGIN_SRC sh
npm install -g fs
#+END_SRC

#+RESULTS:
| /usr/local/lib |          |
| └──            | fs@0.0.2 |
|                |          |

#+BEGIN_SRC js :cmd "babel-node"
  let fs = require('fs');
  let output = fs.readFileSync('data.org','utf8')
                 .trim()
                 .split('\n')
                 .map( line => line.split('|').map( word => word.trim() )
                                              .filter(word => word.length))
                 .reduce((customers , line) => {
                     customers[line[0]] = customers[line[0]] || []
                     customers[line[0]].push({
                         name: line[1],
                         price: line[2],
                         quantity: line[3]
                     })
                     return customers
                  }, {})

  console.log('output', JSON.stringify(output, null, 2));
#+END_SRC

#+RESULTS:
#+begin_example
output {
  "mark Johnson": [
    {
      "name": "waffle",
      "price": "iron",
      "quantity": "80"
    },
    {
      "name": "blender",
      "price": "200",
      "quantity": "1"
    },
    {
      "name": "knife",
      "price": "10",
      "quantity": "4"
    }
  ],
  "Nikita Smith": [
    {
      "name": "waffle",
      "price": "iron",
      "quantity": "80"
    },
    {
      "name": "knife",
      "price": "10",
      "quantity": "2"
    },
    {
      "name": "nuts",
      "price": "20",
      "quantity": "3"
    }
  ]
}
undefined
#+end_example
*** Unclassifed
#+BEGIN_SRC js :cmd "babel-node" :resutls output
let re = /\w+\s/g;
let str = "fee fi fo fum";
let myArr = str.match(re);
//console.log( myArr);
console.log(/[a-z]+/.test(str[2]))
#+END_SRC

#+RESULTS:
: true
: undefined

#+BEGIN_SRC js :cmd "babel-node" :resutls output
var myArray = /d(b+)d/g.exec("cdbbbdsbz");
console.log(myArray.index);
#+END_SRC

#+RESULTS:
: 1
: undefined

#+BEGIN_SRC js :cmd "babel-node" :resutls output
  var myRe = new RegExp("\\w+\\s*","g");
  var myArray = "I go    to   school everyday".match(myRe);
  console.log(myArray);
#+END_SRC

#+RESULTS:
| I | go | to | school | everyday |

#+BEGIN_SRC js :cmd "babel-node" :resutls output
let re = /(\w+)\s(\w+)/;
let str = "John Smith";
let newStr = str.replace(re ,"$2, $1");
console.log(newStr);
#+END_SRC

#+RESULTS:
: Smith, John
: undefined

** crypto
#+BEGIN_SRC js :cmd "babel-node" :resutls output
  function translate(str) {
    var suffix="yay";
    var remainder ="";
    var vowelisthere = false;
    return str.split("").map(function(elm,index){
      var vowel={
        "a": true,
        "e": true,
        "i": true,
        "o": true,
        "u": true
      };
      console.log("|" + vowel[elm] + "|" + elm + "|" );
      if (vowel.hasOwnProperty(elm) && vowel[elm] === true){
          vowelisthere = true;
      }
      if (vowelisthere === false){
          remainder = remainder + elm;
          suffix= "ay";
          return "";
      }
      if (index === str.length -1){
        return elm + remainder + suffix;
      }
      return elm;
    }).join("");
  }

  console.log(translate("consonant"));

#+END_SRC

#+RESULTS:
#+begin_example
|undefined|c|
|true|o|
|undefined|n|
|undefined|s|
|true|o|
|undefined|n|
|true|a|
|undefined|n|
|undefined|t|
onsonantcay
undefined
#+end_example

** missing letter
#+BEGIN_SRC js :cmd "babel-node"  :resutls output
  function fearNotLetter(str) {
    var miss = undefined;
    str.split("").reduce(function(missing,b){
        if (b.charCodeAt(0) !== missing && miss === undefined) {
          console.log("|"+b+"|"+missing +"|" + b.charCodeAt(0) + "|");
          miss=String.fromCharCode(missing);
        }
        return missing+1;
    }, str[0].charCodeAt(0));
    return miss;
  }
fearNotLetter("abcdefghjklmno")

#+END_SRC

#+RESULTS:
: |j|105|106|
: undefined

#+BEGIN_SRC js :cmd "babel-node"
return "A".charCodeAt(0)
#+END_SRC

#+RESULTS:
: 65

** Sorted Union
#+BEGIN_SRC js :cmd "babel-node"
      function diff(arr1, arr2) {
          var arr = arr2;
          // Same, same; but different.

          return arr1.filter( function (val) {
              var flag=true;
              arr = arr.reduce(function(diffs,elm){
                  if(elm === val){
                      flag = false;
                      return diffs;
                  }
                  if (typeof elm === "number")
                      return diffs.concat(elm);
                  return diffs.concat([elm])
              },[]);
              return true;
          }).concat(arr);
      }

    function unite(arr1, arr2, arr3) {
        var args = Array.prototype.slice.call(arguments);
        return args.reduce(function(flat,arr){
            return diff(flat,arr);
        }, []);
    }
  //  return unite([1, 2, 3], [5, 2, 1]);
  return unite([1, 2, 3], [5, 2, 1, 4], [2, 1], [6, 7, 8])

#+END_SRC

#+RESULTS:
| 1 | 2 | 3 | 5 | 4 | 6 | 7 | 8 |
** html sytex change
#+BEGIN_SRC js :cmd "babel-node" :restuls output
    function convert(str) {
      // &colon;&rpar;
        var htmlized = (function() {
            var htmlmap = {
                "&": "&amp;",
                "<": "&lt;",
                ">": "&gt;",
                "\"":  "&quot;",
                "'": "&apos;",
            };
            return function(value) {
                return htmlmap[value];
            }
        }());
      var matched = str.match(/([&<>"'])/g);
      return !matched ? str : matched.reduce(function(st,elm){
          return st.replace(elm, htmlized(elm));
      },str);

    }

var r=convert("abc & bcd");
console.log(r);
#+END_SRC

#+RESULTS:
: abc &amp; bcd
: undefined

#+BEGIN_SRC js :cmd "babel-node" :resutls output
function convert(str){
  return str;
}
var r=convert("Dolce Gabbana Hello");
console.log(r);
#+END_SRC

#+RESULTS:
: Dolce Gabbana Hello
: undefined

** Object
#+BEGIN_SRC js :cmd "babel-node" :resutls output
  function hello(){
      var ar=[3,33,[333]];
      var f = function(arrr) {
          return arrr[2];
      }
      return f(ar).concat(3);
  }
  return hello();
#+END_SRC

#+RESULTS:
| 333 | 3 |

** Looking at characters in a temporary buffer:
#+NAME: distance_char
#+BEGIN_SRC emacs-lisp
    (with-temp-buffer
      (insert "abcdefg")
      (goto-char (point-min))
      (while (not (= (char-after) ?b)) (forward-char))
      (point))
#+END_SRC

#+RESULTS: distance_char
: 2
** Dates and times
Today's date
#+NAME: today
#+BEGIN_SRC emacs-lisp
  (defun today-is ()
    "Display current time."
    (interactive)
    (message (format-time-string "Today is %Y-%m-%d %T")))
  (today-is )
#+END_SRC

#+RESULTS: today
: Today is 2016-03-05 22:42:34

See InsertingTodaysDate.
*** Formatting dates
Use the function ‘format-time-string’ which is a build in function in both Emacsen and works like ‘strftime’:

    ;; Year-Month-Day:
#+NAME: date
#+BEGIN_SRC emacs-lisp
  (with-temp-buffer
    (insert (format-time-string "%Y-%m-%d"))
    (buffer-string))
#+END_SRC

#+RESULTS: date
: 2016-03-05

    ;; Hour:Minutes:Seconds
#+NAME: hour
#+BEGIN_SRC emacs-lisp
  (with-temp-buffer
    (insert (format-time-string "%H-%M-%S"))
    (buffer-string))
#+END_SRC

#+RESULTS: hour
: 22-44-53
*** Read a date from a string.
#+NAME: str_date
#+BEGIN_SRC emacs-lisp
  (let ((time (date-to-time "Tue, 27-Sep-83 12:35:59 EST")))
    (set-time-zone-rule t) ;; Use Universal time.
    (prog1 (format-time-string "%Y-%m-%d %T UTC" time)
      (set-time-zone-rule nil))) ;; Reset to default time zone.
#+END_SRC

#+RESULTS: str_date
: 1983-09-27 17:35:59 UTC
*** Using a temporary buffer instead:
#+NAME: pattern_match2
#+BEGIN_SRC emacs-lisp
    (with-temp-buffer
      (insert "Fight     foo  for food!")
      (goto-char (point-min))
      (re-search-forward "foo*")
      (point))
#+END_SRC

#+RESULTS: pattern_match2
: 14

Alternative without regular expressions: ‘search-forward’.

The functions working on buffers move point to the end of the occurrence found and return it. That’s why the result is 10 instead of 6.
*** Search and replace

#+NAME: searchreplace
#+BEGIN_SRC emacs-lisp
  (replace-regexp-in-string "foo*" "fu" "Fight foo for food!")
#+END_SRC

#+RESULTS: searchreplace
: Fight fu fur fud!

*** Using a temporary buffer instead:
#+NAME: replacematch2
#+BEGIN_SRC emacs-lisp
  (with-temp-buffer
     (insert "*** foo for food!\n*** Abcdefg")
     (goto-char (point-min))
     (while (re-search-forward  (rx-to) nil t)
       (replace-match "#***"))
     (buffer-string))
#+END_SRC

#+RESULTS: replacematch2
: Fight fu fur fud!

*** Search and do something with match
This finds numbers and increments them by one. It depends on ‘decimal-number’ that was defined above. See also IncrementNumber.
#+NAME: numinc
#+BEGIN_SRC emacs-lisp
  (with-temp-buffer
    (insert "A = 32 22434 b=-1d c=333adf")
    (goto-char (point-min))
    (while (re-search-forward (rx-to-string `(: (or num (or "+" "-")))) nil t)
      (goto-char (match-beginning 0))
      (when  (looking-at  (rx-to-string `(: (? (or "+" "-") ) (1+ num)) ) )
        (replace-match
         (number-to-string (+ (string-to-number (match-string 0)) 1)))
        (goto-char (match-end 0)))) (buffer-string))
#+END_SRC

#+RESULTS: numinc
: A = 33 22435 b=0d c=334adf

*** This loads EmacsLisp files listed one per line in a text file.
#+NAME: loadfileselected
#+BEGIN_SRC emacs-lisp
  ;;; hello.el
  ;; (when (file-exists-p filename)
  ;; (load-file filename))
  (let ((files '()))
    (with-current-buffer (find-file-noselect "~/load-file.txt")
      (goto-char  (point-min) )
      (while (re-search-forward (rx-to-string `(:    line-start     (0+ not-newline)  ?.  (or "el" "gz" "tar")   )) nil t)
        (let ((filename (match-string 0)) (list '()))
          (setq flies (cons filename files))))
      (apply #'insert files)(buffer-string) ))
#+END_SRC

#+RESULTS: loadfileselected
: hello.el
: sadf.gz
: adfdsfasdfsd.dsfsd
: dssss.a
: fasdfads.el
: fasdfads.el

*** Extracting submatches from a regex match

Like in most other regex implementations, if you use grouping parentheses in a regular expression, you can extract the text that matched each parenthesized group. Groups are numbered from
the opening parenthesis, left to right. These are also called back references, or backrefs, or matching groups.

#+NAME: email
#+BEGIN_SRC emacs-lisp :var email="hello@gmail.com"
  (defun parse-email(email)
    (let ((user "") (domain ""))
      (save-match-data ; is usually a good idea
        (and (string-match "\\`\\([^@]+\\)@\\([^@]+\\)\\'" email)
             (setq user (match-string 1 email)
                   domain (match-string 2 email) ) ))
      (with-temp-buffer
        (insert (concat "user: " user "\n"))
        (insert (concat "domain: " domain  "\n")) (buffer-string))))
(parse-email email)
#+END_SRC

#+RESULTS: email
: user: hello
: domain: gmail.com

Usually you would use *let* instead of *setq* but this is just a simple self-contained example. See also DynamicBindingVsLexicalBinding.
*** Finding all the strings that match

If you want to list all the matching strings, including subexpressions:

#+NAME: matchStringAll
#+BEGIN_SRC emacs-lisp
  (defun match-strings-all (&optional string)
    "Return the list of all expressions matched in last search.
  STRING is optionally what was given to `string-match'."
    (let ((n-matches (1- (/ (length (match-data)) 2))))
      (mapcar (lambda (i) (match-string i string))
              (number-sequence 0 n-matches))))

  (let ((str "time help"))
    (string-match "time \\([A-Za-z]+\\)$" str)
    (match-strings-all str))
#+END_SRC

#+RESULTS: matchStringAll
| time help | help |

**** Use ‘cons’, ‘push’, or ‘add-to-list’ to prepend a new element to a list. Use ‘nth’ to access an element of a list.

#+NAME: conex1
#+BEGIN_SRC emacs-lisp
    (let ((words '("fight" "foo" "for" "food!")))
      (when (string= "foo" (nth 1 words))
        (setq words (cons "bar" words)))
      words)
#+END_SRC

#+RESULTS: conex1
| bar | fight | foo | for | food! |

See ListModification for more ways of changing a list.
**** Iteration:
#+NAME: iterex1
#+BEGIN_SRC emacs-lisp
    (let ((result  ()))
      (dolist (word  '("fight" "foo" "for" "food!"))
        (when (string-match "o" word) (push word result)))
      (nreverse result))
#+END_SRC

#+RESULTS: iterex1
| (1 2) | (3 4) |
| (1 2) | (5 6) |

Note how ‘push’ adds an element to the front of the list, so that usually the list has to be reversed after the loop. ‘nreverse’ is particularly efficient because it does this destructively.
See DestructiveOperations for more about this.
**** The elements in the copy remain in the original.
More importantly, they are in fact the same elements (i.e., ‘eq’), not copies.
The list is copied, but its elements are shared with the
original list.
#+NAME: sharedcpy
#+BEGIN_SRC emacs-lisp
    (let* ((orig '((1 2) (3 4)))
           (copy (copy-sequence orig)))
      (setcdr (cadr copy) '(0))
      (list orig copy))
#+END_SRC

#+RESULTS: sharedcpy
| (1 2) | (3 0) |
| (1 2) | (3 0) |

**** ‘copy-tree’ is the recursive version of ‘copy-sequence’.
#+NAME: copytree
#+BEGIN_SRC emacs-lisp
  (let* ((orig '((1 2) (3 4)))
         (copy (copy-tree orig)))
    (setcdr (cadr copy) '(0))
    (list orig copy))
#+END_SRC

#+RESULTS: copytree
| (1 2) | (3 4) |
| (1 2) | (3 0) |

**** Filtering:
A ‘filter’ macro has been added to the Emacs development tree. It does what you expect: filters a list, returning a copy that keeps elements that satisfy a predicate and omitting elements
that do not satisfy it.

If your Emacs does not yet have this built in, you can use ‘dolist’ or ‘mapcar’ to iterate over a list with a conditional, and then use ‘delq’ to remove the ‘nil’ values.

#+NAME: myfilter
#+BEGIN_SRC emacs-lisp
  (defun my-filter (condp lst)
    (delq nil
          (mapcar (lambda (x) (and (funcall condp x) x)) lst)))

    (let ((num-list '(1 'a 2 "nil" 3 nil 4)))
      (my-filter 'numberp num-list))
#+END_SRC

#+RESULTS: myfilter
| 1 | 2 | 3 | 4 |

**** Here is a version of quicksort:

#+NAME: quicksort
#+BEGIN_SRC emacs-lisp
 (defun quicksort (lst)
   "Implement the quicksort algorithm."
   (if (null lst) nil
     (let* ((spl (car lst))
            (rst (cdr lst))
            (smalp (lambda (x)
                  (< x spl))))
       (append (quicksort (remove-if-not smalp rst))
               (list spl)
               (quicksort (remove-if smalp rst))))))
 (quicksort '(5 7 1 3 -9 8 7 -4 0))
#+END_SRC

#+RESULTS: quicksort
| -9 | -4 | 0 | 1 | 3 | 5 | 7 | 7 | 8 |

****  The following function was written by tali713 in response to hypnocat’s question regarding a filter function in #emacs:

#+NAME: hyponocat
#+BEGIN_SRC emacs-lisp
    (defun keep-when (pred seq)
      (let ((del (make-symbol "del")))
        (remove del (mapcar (lambda (el)
			      (if (funcall pred el) el del)) seq))))


  (keep-when 'atom '(1 2 3 (4 5) 6 nil t foo))
#+END_SRC

#+RESULTS: hyponocat
| 1 | 2 | 3 | 6 | nil | t | foo |

  ==> (1 2 3 6 nil t foo)

Updated 31/05/2013.
*** Association lists

The ElispManual has examples of finding and deleting values in an association list, or alist. Here are cases when the car values are strings.

#+NAME: acclist
#+BEGIN_SRC emacs-lisp
  (assoc "2" '(("2" . 23) ("1" . 3) ("231") ("3" . 3)))
#+END_SRC

#+RESULTS: acclist
: (2 . 23)


#+NAME: acclisp2
#+BEGIN_SRC emacs-lisp
  (mapcar (lambda (c) (cons c (string c))) (number-sequence 56 65))
#+END_SRC

#+RESULTS: acclisp2

  ==> ((56 . "8") (57 . "9") (58 . ":") (59 . ";") (60 . "<")
       (61 . "=") (62 . ">") (63 . "?") (64 . "@") (65 . "A"))
  (assq 64
        (mapcar (lambda (c) (cons c (string c))) (number-sequence 56 65)))
  ==> (64 . "@")
  (assq 55
        (mapcar (lambda (c) (cons c (string c))) (number-sequence 56 65)))
  ==> nil

Deleting:

#+NAME: delq
#+BEGIN_SRC emacs-lisp
  (let ((alist '(("a" . 1) ("b" . 2))))
    (delq (assoc "a" alist) alist))
#+END_SRC

#+RESULTS: delq

Matches with a test function other than ‘equal’:

#+NAME: assocdefault
#+BEGIN_SRC emacs-lisp
  (let ((alist '(("ab" . 1) ("bc" . 2) ("cd" . 3))))
    (assoc-default "c" alist (lambda (x y) (string-match y x))))
#+END_SRC

#+RESULTS: assocdefault
: 2

The alist functions are useful for finding the first instance of a value in any list, not just association lists, and even when there are duplicates.

The following uses ‘mapcar’ to associate the ‘major-mode’ to each buffer returned by ‘buffer-list’, then ‘assq’ to find the first buffer where the major mode is ‘fundamental-mode’.

#+NAME: acc3
#+BEGIN_SRC emacs-lisp
  (assq 'fundamental-mode
        (mapcar
         (lambda (b)
           (cons (buffer-local-value 'major-mode b) b))
         (buffer-list)))
#+END_SRC

#+RESULTS: acc3
: (fundamental-mode . *About GNU Emacs*)


You can also find values in regular lists, by converting them to association lists with a null cdr.

Here’s an association list of random numbers with no associated value.

#+NAME: randomnil
#+BEGIN_SRC emacs-lisp
  '((8 . nil) (3 . nil) (1 . nil) (7 . nil) (3 . nil) (6 . nil) (9 . nil))
#+END_SRC

#+RESULTS: randomnil
| 8 |
| 3 |
| 1 |
| 7 |
| 3 |
| 6 |
| 9 |


This is really just making a list for each number – a “list of lists” – which can be done with ‘mapcar’ and ‘list’.

#+NAME: listoflistassq
#+BEGIN_SRC emacs-lisp
  (mapcar 'list '(8 3 1 7 3 6 9))
  (assq 3 (mapcar 'list '(8 3 1 7 3 6 9)))
#+END_SRC

#+RESULTS: listoflistassq
| 3 |

*** Vectors

Vectors are fixed in size, and their elements can be accessed in constant time (neither of which is the case for lists).

#+NAME: vector2
#+BEGIN_SRC emacs-lisp
    (let ((words ["fight" "foo" "for" "food!"]))
      (when (string= "foo" (aref words 1))
        (aset words 1 "bar"))
      words)
#+END_SRC

#+RESULTS: vector2
: ["fight" "bar" "for" "food!"]


**** Convert vector to list

All vectors are sequences and the map functions work on sequences, so:

#+NAME: veclist
#+BEGIN_SRC emacs-lisp
(mapcar 'identity [1 2 3 4])
#+END_SRC

#+RESULTS: veclist
| 1 | 2 | 3 | 4 |

  ==> (1 2 3 4)

Here is another Lisp idiom for the same thing:

#+NAME: veclist3
#+BEGIN_SRC emacs-lisp
(append [1 2 3 4] ())
#+END_SRC

#+RESULTS: veclist3
| 1 | 2 | 3 | 4 |

***  Hash tables

Hash tables map keys to values. They are similar to alists, but they are typically more efficient for a large number of keys.

See HashMap.

Storing and retrieving keys and values

By default, hash tables use ‘eql’ to compare keys. This is not appropriate for strings: (eql "alex" "alex") ⇒ nil. Use ‘equal’ in such cases:

#+NAME: hashmap
#+BEGIN_SRC emacs-lisp
    (let ((nick-table (make-hash-table :test 'equal)))
      (puthash "kensanata" "Alex Schroeder" nick-table)
      (gethash "kensanata" nick-table))
#+END_SRC

#+RESULTS: hashmap
: Alex Schroeder

**** Iterate:

#+NAME: iteratehash
#+BEGIN_SRC emacs-lisp
    (let ((nick-table (make-hash-table :test 'equal))
          nicks)
      (puthash "kensanata" "Alex Schroeder" nick-table)
      (puthash "e1f" "Luis Fernandes" nick-table)
      (puthash "pjb" "Pascal J. Bourguignon" nick-table)
      (maphash (lambda (nick real-name)
                 (setq nicks (cons nick nicks)))
               nick-table)
      nicks)
#+END_SRC

#+RESULTS: iteratehash
| pjb | e1f | kensanata |

**** Sorting keys

Use ‘maphash’ to build up a list of keys, sort it, and then loop through the list:

#+NAME: hashmapsort
#+BEGIN_SRC emacs-lisp
    (let ((nick-table (make-hash-table :test 'equal))
          nicks)
      (puthash "kensanata" "Alex Schroeder" nick-table)
      (puthash "e1f" "Luis Fernandes" nick-table)
      (puthash "pjb" "Pascal J. Bourguignon" nick-table)
      (maphash (lambda (nick real-name)
                 (setq nicks (cons nick nicks)))
               nick-table)
      (mapcar (lambda (nick)
                (concat nick " => " (gethash nick nick-table)))
              (sort nicks 'string<)))
#+END_SRC

#+RESULTS: hashmapsort
| e1f => Luis Fernandes | kensanata => Alex Schroeder | pjb => Pascal J. Bourguignon |

*** For troubled network auto save frequently
#+BEGIN_SRC elisp
(setq auto-save-interval 1
          auto-save-timeout 1)
#+END_SRC

#+RESULTS:
: 1

